# Личные данные

CITIES = [
    ('EVN', 'Ереван'),
    ('DLN', 'Дилижан'),
    ('GMR', 'Гюмри'),
    ('MOW', 'Москва'),
    ('SPB', 'Санкт-Петербург'),
    ('OTH', 'Другое')
]

# Ситтеры

ANIMALS = [
    ('CAT', 'Кошка'),
    ('DOG', 'Собака'),
    ('OTH', 'Другое'),
    ('NO', 'Нет'),
]

HOME = [
    ('FLAT', 'Квартира'),
    ('HOUS', 'Частный дом'),
]

# Питомцы

SPECIES = [
    ('CAT', 'Кошка'),
    ('DOG', 'Собака'),
    ('OTH', 'Другое'),
]

GENDER = [
    ('FEM', 'Самка'),
    ('MAL', 'Самец'),
]

# Cобаки

PULLS = [
    ('NO', 'Не тянет'),
    ('SMT', 'Иногда тянет'),
    ('YES', 'Сильно тянет'),
]

PICKS = [
    ('NO', 'Не подбирает'),
    ('SMT', 'Иногда тянет'),
    ('YES', 'Постоянно'),
]

TAKE = [
    ('YES', 'Да'),
    ('NO', 'Нет'),
    ('IDK', 'Я бы не рисковал'),
]

AGGRESSION = [
    ('CAT', 'Кошки'),
    ('DOG', 'Собаки'),
    ('PPL', 'Люди'),
    ('MOT', 'Мотоциклы'),
    ('BIK', 'Велосипеды'),
    ('CAR', 'Машины'),
    ('NO', 'Нет'),
]

NO_LEASH = [
    ('YES', 'Да'),
    ('NO', 'Нет'),
]

DOGS_CONTACT = [
    ('YES', 'Да'),
    ('NO', 'Нет'),
]

WASH_PAWS = [
    ('BATH', 'Ванная+душ'),
    ('RAG', 'Ведро+тряпка'),
    ('SINK', 'Раковина+душ'),
    ('WIPE', 'Влажные салфетки'),
    ('WASH', 'Лапомойка'),
    ('OTH', 'Другое'),
]

PEE_HOME = [
    ('YES', 'Да'),
    ('NO', 'Нет'),
]

GNAW_HOME = [
    ('NO', 'Нет'),
    ('SMT', 'Иногда'),
    ('YES', 'Часто'),
]

WALK = [
    ('NO', 'Без выгулов'),
    ('1', '1 раз в день'),
    ('2', '2 раза в день'),
    ('3', '3 раза в день'),
    ('4', '4 раза в день'),
]

# Котики

OUTSIDE_LB = [
    ('NO', 'Нет, никогда'),
    ('SMT', 'Да, но если лоток грязный'),
    ('YES', 'О, да'),
]